
1.数组的定义
a = list()
a = []

a = [1, 2, 3, 4, 5]
数组内的元素可以是不同的类型
a = [1, '2', 3, '4', 5 , 0.2] 

a = [1] * 10

2.数组的基本操作
a = [1, 2, 3] + [4, 5, 6]	
1 in a
0 not in a
min(a)
max(a)
len(a)
a.extend([4,5,6])
a.append(1)
a.insert(0, 0)
a.pop()

3.通过数组实现简单的队列
queue = []
task = 1
queue.pop()

4.切片
a = [1,2,3,4,5,6]

##################
# 0  1  2  3  4  5
  1, 2, 3, 4, 5, 6
#-6 -5 -4 -3 -2 -1
################
a[1] #通过下标索引
a[0:2]
a[:2]
a[2:]
a[-1]
a[0:-1]
a[:] #数组拷贝

数组切片语法
[start:end:step]
start:起始索引，从0开始
end：结束索引,但是end-1为实际的索引
step：步长，步长为正时，从左向右取值。步长为负时，反向取值
a[0:6:2] #取奇数
a[6:0:-2] #反着取。看看结果


